Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
/**
  ******************************************************************************
  * @file    py32e407_hal_usbd.c
  * @author  MCU Application Team
  * @brief   USBDEV HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
    [..]
      The USBDEV HAL driver can be used as follows:

     (#) Declare a USBDEV_HandleTypeDef handle structure, for example:
         USBDEV_HandleTypeDef  husbd;

     (#) Fill parameters of Init structure in USBHOST handle

     (#) Call HAL_USBDEV_Init() API to initialize the USBDEV peripheral (Core, Device core, ...)

     (#) Initialize the USBDEV low level resources through the HAL_USBDEV_MspInit() API:
         (##) Enable the USBDEV/USB Low Level interface clock using
              (+++) __HAL_RCC_USB_CLK_ENABLE(); For USB Device only FS peripheral

         (##) Initialize the related GPIO clocks
         (##) Configure USBDEV pin-out
         (##) Configure USBDEV NVIC interrupt

     (#)Associate the Upper USB device stack to the HAL USBDEV Driver:
         (##) husbd.pData = pdev;

     (#)Enable USBDEV transmission and reception:
         (##) HAL_USBDEV_Start();

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @defgroup USBDEV USBDEV
  * @brief USBDEV HAL module driver
  * @{
  */

#ifdef HAL_USBD_MODULE_ENABLED

#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup USBDEV_Private_Macros USBDEV Private Macros
  * @{
  */
#define USBDEV_MIN(a, b)  (((a) < (b)) ? (a) : (b))
#define USBDEV_MAX(a, b)  (((a) > (b)) ? (a) : (b))
/**
  * @}
  */

/* Private functions prototypes ----------------------------------------------*/
/** @defgroup USBDEV_Private_Functions USBDEV Private Functions
  * @{
  */
#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
static HAL_StatusTypeDef USBDEV_WriteEmptyTxFifo(USBDEV_HandleTypeDef *husbd, uint32_t epnum);
static HAL_StatusTypeDef USBDEV_EP_OutXfrComplete_int(USBDEV_HandleTypeDef *husbd, uint32_t epnum);
static HAL_StatusTypeDef USBDEV_EP_OutSetupPacket_int(USBDEV_HandleTypeDef *husbd, uint32_t epnum);
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup USBDEV_Exported_Functions USBDEV Exported Functions
  * @{
  */

/** @defgroup USBDEV_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
            ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the USBDEV according to the specified
  *         parameters in the USBDEV_InitTypeDef and initialize the associated handle.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_Init(USBDEV_HandleTypeDef *husbd)
{
#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
  USB_OTG_GlobalTypeDef *USBx;
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */
  uint8_t i;

  /* Check the USBDEV handle allocation */
  if (husbd == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_USBDEV_ALL_INSTANCE(husbd->Instance));

#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
  USBx = husbd->Instance;
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */

  if (husbd->State == HAL_USBDEV_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    husbd->Lock = HAL_UNLOCKED;

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
    husbd->SOFCallback = HAL_USBDEV_SOFCallback;
    husbd->SetupStageCallback = HAL_USBDEV_SetupStageCallback;
    husbd->ResetCallback = HAL_USBDEV_ResetCallback;
    husbd->SuspendCallback = HAL_USBDEV_SuspendCallback;
    husbd->ResumeCallback = HAL_USBDEV_ResumeCallback;
    husbd->ConnectCallback = HAL_USBDEV_ConnectCallback;
    husbd->DisconnectCallback = HAL_USBDEV_DisconnectCallback;
    husbd->DataOutStageCallback = HAL_USBDEV_DataOutStageCallback;
    husbd->DataInStageCallback = HAL_USBDEV_DataInStageCallback;
    husbd->ISOOUTIncompleteCallback = HAL_USBDEV_ISOOUTIncompleteCallback;
    husbd->ISOINIncompleteCallback = HAL_USBDEV_ISOINIncompleteCallback;

    if (husbd->MspInitCallback == NULL)
    {
      husbd->MspInitCallback = HAL_USBDEV_MspInit;
    }

    /* Init the low level hardware */
    husbd->MspInitCallback(husbd);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    HAL_USBDEV_MspInit(husbd);
#endif /* (USE_HAL_USBDEV_REGISTER_CALLBACKS) */
  }

  husbd->State = HAL_USBDEV_STATE_BUSY;

#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
  /* Disable DMA mode for FS instance */
  if ((USBx->CID & (0x1U << 8)) == 0U)
  {
    husbd->Init.dma_enable = 0U;
  }
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */

  /* Disable the Interrupts */
  __HAL_USBDEV_DISABLE(husbd);

  /* Init the Core (common init.) */
  if (USB_CoreInit(husbd->Instance, husbd->Init) != HAL_OK)
  {
    husbd->State = HAL_USBDEV_STATE_ERROR;
    return HAL_ERROR;
  }

