Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
  /* Force Device Mode*/
  (void)USB_SetCurrentMode(husbd->Instance, USB_DEVICE_MODE);

  /* Init endpoints structures */
  for (i = 0U; i < husbd->Init.dev_endpoints; i++)
  {
    /* Init ep structure */
    husbd->IN_ep[i].is_in = 1U;
    husbd->IN_ep[i].num = i;
    husbd->IN_ep[i].tx_fifo_num = i;
    /* Control until ep is activated */
    husbd->IN_ep[i].type = EP_TYPE_CTRL;
    husbd->IN_ep[i].maxpacket = 0U;
    husbd->IN_ep[i].xfer_buff = 0U;
    husbd->IN_ep[i].xfer_len = 0U;
  }

  for (i = 0U; i < husbd->Init.dev_endpoints; i++)
  {
    husbd->OUT_ep[i].is_in = 0U;
    husbd->OUT_ep[i].num = i;
    /* Control until ep is activated */
    husbd->OUT_ep[i].type = EP_TYPE_CTRL;
    husbd->OUT_ep[i].maxpacket = 0U;
    husbd->OUT_ep[i].xfer_buff = 0U;
    husbd->OUT_ep[i].xfer_len = 0U;
  }

  /* Init Device */
  if (USB_DevInit(husbd->Instance, husbd->Init) != HAL_OK)
  {
    husbd->State = HAL_USBDEV_STATE_ERROR;
    return HAL_ERROR;
  }

  husbd->USB_Address = 0U;
  husbd->State = HAL_USBDEV_STATE_READY;
  (void)USB_DevDisconnect(husbd->Instance);

  return HAL_OK;
}

/**
  * @brief  DeInitializes the USBDEV peripheral.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_DeInit(USBDEV_HandleTypeDef *husbd)
{
  /* Check the USBDEV handle allocation */
  if (husbd == NULL)
  {
    return HAL_ERROR;
  }

  husbd->State = HAL_USBDEV_STATE_BUSY;

  /* Stop Device */
  (void)HAL_USBDEV_Stop(husbd);

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
  if (husbd->MspDeInitCallback == NULL)
  {
    husbd->MspDeInitCallback = HAL_USBDEV_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware */
  husbd->MspDeInitCallback(husbd);
#else
  /* DeInit the low level hardware: CLOCK, NVIC.*/
  HAL_USBDEV_MspDeInit(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

  husbd->State = HAL_USBDEV_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief  Initializes the USBDEV MSP.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_MspInit(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes USBDEV MSP.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_MspDeInit(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_MspDeInit could be implemented in the user file
   */
}

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User USB USBDEV Callback
  *         To be used instead of the weak predefined callback
  * @param  husbd USB USBDEV handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_USBDEV_SOF_CB_ID USB USBDEV SOF callback ID
  *          @arg @ref HAL_USBDEV_SETUPSTAGE_CB_ID USB USBDEV Setup callback ID
  *          @arg @ref HAL_USBDEV_RESET_CB_ID USB USBDEV Reset callback ID
  *          @arg @ref HAL_USBDEV_SUSPEND_CB_ID USB USBDEV Suspend callback ID
  *          @arg @ref HAL_USBDEV_RESUME_CB_ID USB USBDEV Resume callback ID
  *          @arg @ref HAL_USBDEV_CONNECT_CB_ID USB USBDEV Connect callback ID
  *          @arg @ref HAL_USBDEV_DISCONNECT_CB_ID OTG USBDEV Disconnect callback ID
  *          @arg @ref HAL_USBDEV_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref HAL_USBDEV_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_RegisterCallback(USBDEV_HandleTypeDef *husbd, HAL_USBDEV_CallbackIDTypeDef CallbackID, pUSBDEV_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }
  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_USBDEV_SOF_CB_ID :
        husbd->SOFCallback = pCallback;
        break;

      case HAL_USBDEV_SETUPSTAGE_CB_ID :
        husbd->SetupStageCallback = pCallback;
        break;

      case HAL_USBDEV_RESET_CB_ID :
        husbd->ResetCallback = pCallback;
        break;

      case HAL_USBDEV_SUSPEND_CB_ID :
        husbd->SuspendCallback = pCallback;
        break;

      case HAL_USBDEV_RESUME_CB_ID :
        husbd->ResumeCallback = pCallback;
        break;

      case HAL_USBDEV_CONNECT_CB_ID :
        husbd->ConnectCallback = pCallback;
        break;

      case HAL_USBDEV_DISCONNECT_CB_ID :
        husbd->DisconnectCallback = pCallback;
        break;

      case HAL_USBDEV_MSPINIT_CB_ID :
        husbd->MspInitCallback = pCallback;
        break;

      case HAL_USBDEV_MSPDEINIT_CB_ID :
        husbd->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (husbd->State == HAL_USBDEV_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_USBDEV_MSPINIT_CB_ID :
        husbd->MspInitCallback = pCallback;
        break;

      case HAL_USBDEV_MSPDEINIT_CB_ID :
        husbd->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);
  return status;
}

/**
  * @brief  Unregister an USB USBDEV Callback
  *         USB USBDEV callabck is redirected to the weak predefined callback
  * @param  husbd USB USBDEV handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_USBDEV_SOF_CB_ID USB USBDEV SOF callback ID
  *          @arg @ref HAL_USBDEV_SETUPSTAGE_CB_ID USB USBDEV Setup callback ID
  *          @arg @ref HAL_USBDEV_RESET_CB_ID USB USBDEV Reset callback ID
  *          @arg @ref HAL_USBDEV_SUSPEND_CB_ID USB USBDEV Suspend callback ID
  *          @arg @ref HAL_USBDEV_RESUME_CB_ID USB USBDEV Resume callback ID
  *          @arg @ref HAL_USBDEV_CONNECT_CB_ID USB USBDEV Connect callback ID
  *          @arg @ref HAL_USBDEV_DISCONNECT_CB_ID OTG USBDEV Disconnect callback ID
  *          @arg @ref HAL_USBDEV_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref HAL_USBDEV_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_UnRegisterCallback(USBDEV_HandleTypeDef *husbd, HAL_USBDEV_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbd);

  /* Setup Legacy weak Callbacks  */
  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_USBDEV_SOF_CB_ID :
        husbd->SOFCallback = HAL_USBDEV_SOFCallback;
        break;

      case HAL_USBDEV_SETUPSTAGE_CB_ID :
        husbd->SetupStageCallback = HAL_USBDEV_SetupStageCallback;
        break;

      case HAL_USBDEV_RESET_CB_ID :
        husbd->ResetCallback = HAL_USBDEV_ResetCallback;
        break;

      case HAL_USBDEV_SUSPEND_CB_ID :
        husbd->SuspendCallback = HAL_USBDEV_SuspendCallback;
        break;

      case HAL_USBDEV_RESUME_CB_ID :
        husbd->ResumeCallback = HAL_USBDEV_ResumeCallback;
        break;

      case HAL_USBDEV_CONNECT_CB_ID :
        husbd->ConnectCallback = HAL_USBDEV_ConnectCallback;
        break;

      case HAL_USBDEV_DISCONNECT_CB_ID :
        husbd->DisconnectCallback = HAL_USBDEV_DisconnectCallback;
        break;

      case HAL_USBDEV_MSPINIT_CB_ID :
        husbd->MspInitCallback = HAL_USBDEV_MspInit;
        break;

