Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
      case HAL_USBDEV_MSPDEINIT_CB_ID :
        husbd->MspDeInitCallback = HAL_USBDEV_MspDeInit;
        break;

      default :
        /* Update the error code */
        husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (husbd->State == HAL_USBDEV_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_USBDEV_MSPINIT_CB_ID :
        husbd->MspInitCallback = HAL_USBDEV_MspInit;
        break;

      case HAL_USBDEV_MSPDEINIT_CB_ID :
        husbd->MspDeInitCallback = HAL_USBDEV_MspDeInit;
        break;

      default :
        /* Update the error code */
        husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);
  return status;
}

/**
  * @brief  Register USB USBDEV Data OUT Stage Callback
  *         To be used instead of the weak HAL_USBDEV_DataOutStageCallback() predefined callback
  * @param  husbd USBDEV handle
  * @param  pCallback pointer to the USB USBDEV Data OUT Stage Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_RegisterDataOutStageCallback(USBDEV_HandleTypeDef *husbd, pUSBDEV_DataOutStageCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->DataOutStageCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  UnRegister the USB USBDEV Data OUT Stage Callback
  *         USB USBDEV Data OUT Stage Callback is redirected to the weak HAL_USBDEV_DataOutStageCallback() predefined callback
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_UnRegisterDataOutStageCallback(USBDEV_HandleTypeDef *husbd)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->DataOutStageCallback = HAL_USBDEV_DataOutStageCallback; /* Legacy weak DataOutStageCallback  */
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  Register USB USBDEV Data IN Stage Callback
  *         To be used instead of the weak HAL_USBDEV_DataInStageCallback() predefined callback
  * @param  husbd USBDEV handle
  * @param  pCallback pointer to the USB USBDEV Data IN Stage Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_RegisterDataInStageCallback(USBDEV_HandleTypeDef *husbd, pUSBDEV_DataInStageCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->DataInStageCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  UnRegister the USB USBDEV Data IN Stage Callback
  *         USB USBDEV Data OUT Stage Callback is redirected to the weak HAL_USBDEV_DataInStageCallback() predefined callback
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_UnRegisterDataInStageCallback(USBDEV_HandleTypeDef *husbd)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->DataInStageCallback = HAL_USBDEV_DataInStageCallback; /* Legacy weak DataInStageCallback  */
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  Register USB USBDEV Iso OUT incomplete Callback
  *         To be used instead of the weak HAL_USBDEV_ISOOUTIncompleteCallback() predefined callback
  * @param  husbd USBDEV handle
  * @param  pCallback pointer to the USB USBDEV Iso OUT incomplete Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_RegisterIsoOutIncpltCallback(USBDEV_HandleTypeDef *husbd, pUSBDEV_IsoOutIncpltCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->ISOOUTIncompleteCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  UnRegister the USB USBDEV Iso OUT incomplete Callback
  *         USB USBDEV Iso OUT incomplete Callback is redirected to the weak HAL_USBDEV_ISOOUTIncompleteCallback() predefined callback
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_UnRegisterIsoOutIncpltCallback(USBDEV_HandleTypeDef *husbd)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbd);

