Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->ISOOUTIncompleteCallback = HAL_USBDEV_ISOOUTIncompleteCallback; /* Legacy weak ISOOUTIncompleteCallback  */
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  Register USB USBDEV Iso IN incomplete Callback
  *         To be used instead of the weak HAL_USBDEV_ISOINIncompleteCallback() predefined callback
  * @param  husbd USBDEV handle
  * @param  pCallback pointer to the USB USBDEV Iso IN incomplete Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_RegisterIsoInIncpltCallback(USBDEV_HandleTypeDef *husbd, pUSBDEV_IsoInIncpltCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->ISOINIncompleteCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

/**
  * @brief  UnRegister the USB USBDEV Iso IN incomplete Callback
  *         USB USBDEV Iso IN incomplete Callback is redirected to the weak HAL_USBDEV_ISOINIncompleteCallback() predefined callback
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_UnRegisterIsoInIncpltCallback(USBDEV_HandleTypeDef *husbd)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbd);

  if (husbd->State == HAL_USBDEV_STATE_READY)
  {
    husbd->ISOINIncompleteCallback = HAL_USBDEV_ISOINIncompleteCallback; /* Legacy weak ISOINIncompleteCallback  */
  }
  else
  {
    /* Update the error code */
    husbd->ErrorCode |= HAL_USBDEV_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbd);

  return status;
}

#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup USBDEV_Exported_Functions_Group2 Input and Output operation functions
 *  @brief   Data transfers functions
 *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the USBDEV data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Start the USB device
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_Start(USBDEV_HandleTypeDef *husbd)
{
  __HAL_LOCK(husbd);
  (void)USB_DevConnect(husbd->Instance);
  __HAL_USBDEV_ENABLE(husbd);
  __HAL_UNLOCK(husbd);
  return HAL_OK;
}

/**
  * @brief  Stop the USB device.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_Stop(USBDEV_HandleTypeDef *husbd)
{
  __HAL_LOCK(husbd);
  __HAL_USBDEV_DISABLE(husbd);

  if (USB_StopDevice(husbd->Instance) != HAL_OK)
  {
    __HAL_UNLOCK(husbd);
    return HAL_ERROR;
  }

  (void)USB_DevDisconnect(husbd->Instance);
  __HAL_UNLOCK(husbd);

  return HAL_OK;
}
#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
/**
  * @brief  Handles USBDEV interrupt request.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
void HAL_USBDEV_IRQHandler(USBDEV_HandleTypeDef *husbd)
{
  USB_OTG_GlobalTypeDef *USBx = husbd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t i, ep_intr, epint, epnum;
  uint32_t fifoemptymsk, temp;
  USB_OTG_EPTypeDef *ep;

  /* ensure that we are in device mode */
  if (USB_GetMode(husbd->Instance) == USB_OTG_MODE_DEVICE)
  {
    /* avoid spurious interrupt */
    if (__HAL_USBDEV_IS_INVALID_INTERRUPT(husbd))
    {
      return;
    }

    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_MMIS))
    {
      /* incorrect mode, acknowledge the interrupt */
      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_MMIS);
    }

    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_OEPINT))
    {
      epnum = 0U;

      /* Read in the device interrupt bits */
      ep_intr = USB_ReadDevAllOutEpInterrupt(husbd->Instance);

      while (ep_intr != 0U)
      {
        if ((ep_intr & 0x1U) != 0U)
        {
          epint = USB_ReadDevOutEPInterrupt(husbd->Instance, (uint8_t)epnum);

          /* Handler OUT transfer completed interrupt */
          if ((epint & USB_OTG_DOEPINT_XFRC) == USB_OTG_DOEPINT_XFRC)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_XFRC);
            (void)USBDEV_EP_OutXfrComplete_int(husbd, epnum);
          }

          /* Clear EP disabled interrupt */
          if ((epint & USB_OTG_DOEPINT_EPDISD) == USB_OTG_DOEPINT_EPDISD)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_EPDISD);
          }

          if ((epint & USB_OTG_DOEPINT_STUP) == USB_OTG_DOEPINT_STUP)
          {
            /* Class B setup phase done for previous decoded setup */
            (void)USBDEV_EP_OutSetupPacket_int(husbd, epnum);
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STUP);
          }

          /* Clear OUT token received when endpoint disabled interrupt */
          if ((epint & USB_OTG_DOEPINT_OTEPDIS) == USB_OTG_DOEPINT_OTEPDIS)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_OTEPDIS);
          }

          /* Clear Status Phase Received interrupt */
          if ((epint & USB_OTG_DOEPINT_STSPHSRX) == USB_OTG_DOEPINT_STSPHSRX)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STSPHSRX);
          }

          /* Clear OUT NAK interrupt */
          if ((epint & USB_OTG_DOEPINT_NAK) == USB_OTG_DOEPINT_NAK)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_NAK);
          }

