Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_IEPINT))
    {
      /* Read in the device interrupt bits */
      ep_intr = USB_ReadDevAllInEpInterrupt(husbd->Instance);

      epnum = 0U;

      while (ep_intr != 0U)
      {
        if ((ep_intr & 0x1U) != 0U) /* In ITR */
        {
          epint = USB_ReadDevInEPInterrupt(husbd->Instance, (uint8_t)epnum);

          /* Handle IN transmit complete interrupt */
          if ((epint & USB_OTG_DIEPINT_XFRC) == USB_OTG_DIEPINT_XFRC)
          {
            /* Disable EP fifo empty interrupt */
            fifoemptymsk = (uint32_t)(0x1UL << (epnum & EP_ADDR_MSK));
            USBx_DEVICE->DIEPEMPMSK &= ~fifoemptymsk;

            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_XFRC);

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
            husbd->DataInStageCallback(husbd, (uint8_t)epnum);
#else
            HAL_USBDEV_DataInStageCallback(husbd, (uint8_t)epnum);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */
          }

          /* Clear timeout condition interrupt */
          if ((epint & USB_OTG_DIEPINT_TOC) == USB_OTG_DIEPINT_TOC)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_TOC);
          }

          /* Clear IN token received when TxFIFO is empty interrupt */
          if ((epint & USB_OTG_DIEPINT_ITTXFE) == USB_OTG_DIEPINT_ITTXFE)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_ITTXFE);
          }

          /* Clear IN endpoint NAK effective interrupt */
          if ((epint & USB_OTG_DIEPINT_INEPNE) == USB_OTG_DIEPINT_INEPNE)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_INEPNE);
          }

          /* Clear IN endpoint disable interrupt */
          if ((epint & USB_OTG_DIEPINT_EPDISD) == USB_OTG_DIEPINT_EPDISD)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_EPDISD);
          }

          /* Handle TX fifo empty interrupt */
          if ((epint & USB_OTG_DIEPINT_TXFE) == USB_OTG_DIEPINT_TXFE)
          {
            (void)USBDEV_WriteEmptyTxFifo(husbd, epnum);
          }
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    /* Handle Resume Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_WKUPINT))
    {
      /* Clear the Remote Wake-up Signaling */
      USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_RWUSIG;

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->ResumeCallback(husbd);
#else
      HAL_USBDEV_ResumeCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_WKUPINT);
    }

    /* Handle Suspend Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_USBSUSP))
    {
      if ((USBx_DEVICE->DSTS & USB_OTG_DSTS_SUSPSTS) == USB_OTG_DSTS_SUSPSTS)
      {
#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
        husbd->SuspendCallback(husbd);
#else
        HAL_USBDEV_SuspendCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */
      }
      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_USBSUSP);
    }
    /* Handle Reset Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_USBRST))
    {
      USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_RWUSIG;

      (void)USB_FlushTxFifo(husbd->Instance, 0x10U);

      for (i = 0U; i < husbd->Init.dev_endpoints; i++)
      {
        /* Clear all interrupt flag */
        USBx_INEP(i)->DIEPINT = 0xFB7FU;
        USBx_INEP(i)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
        USBx_OUTEP(i)->DOEPINT = 0xFB7FU;
        USBx_OUTEP(i)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
      }
      /* Enable EP0 interrupt */
      USBx_DEVICE->DAINTMSK |= 0x10001U;

      USBx_DEVICE->DOEPMSK |= USB_OTG_DOEPMSK_STUPM |
                              USB_OTG_DOEPMSK_XFRCM |
                              USB_OTG_DOEPMSK_EPDM  |
                              USB_OTG_DOEPMSK_STSPHSRXM |
                              USB_OTG_DOEPMSK_NAKM;

      USBx_DEVICE->DIEPMSK |= USB_OTG_DIEPMSK_TOM |
                              USB_OTG_DIEPMSK_XFRCM |
                              USB_OTG_DIEPMSK_EPDM;
      

      /* Set Default Address to 0 */
      USBx_DEVICE->DCFG &= ~USB_OTG_DCFG_DAD;

      /* setup EP0 to receive SETUP packets */
      (void)USB_EP0_OutStart(husbd->Instance, (uint8_t *)husbd->Setup);

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_USBRST);
    }

    /* Handle Enumeration done Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_ENUMDNE))
    {
      (void)USB_ActivateSetup(husbd->Instance);
      husbd->Init.speed = USB_GetDevSpeed(husbd->Instance);

      /* Set USB Turnaround time */
      (void)USB_SetTurnaroundTime(husbd->Instance);

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->ResetCallback(husbd);
#else
      HAL_USBDEV_ResetCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_ENUMDNE);
    }

    /* Handle RxQLevel Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_RXFLVL))
    {
      USB_MASK_INTERRUPT(husbd->Instance, USB_OTG_GINTSTS_RXFLVL);

      temp = USBx->GRXSTSP;

      ep = &husbd->OUT_ep[temp & USB_OTG_GRXSTSP_EPNUM];

      if (((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_DATA_UPDT)
      {
        if ((temp & USB_OTG_GRXSTSP_BCNT) != 0U)
        {
          (void)USB_ReadPacket(USBx, ep->xfer_buff,
                               (uint16_t)((temp & USB_OTG_GRXSTSP_BCNT) >> 4));

          ep->xfer_buff += (temp & USB_OTG_GRXSTSP_BCNT) >> 4;
          ep->xfer_count += (temp & USB_OTG_GRXSTSP_BCNT) >> 4;
        }
      }
      else if (((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_SETUP_UPDT)
      {
        (void)USB_ReadPacket(USBx, (uint8_t *)husbd->Setup, 8U);
        ep->xfer_count += (temp & USB_OTG_GRXSTSP_BCNT) >> 4;
      }
      else
      {
        /* ... */
      }
      USB_UNMASK_INTERRUPT(husbd->Instance, USB_OTG_GINTSTS_RXFLVL);
    }

    /* Handle SOF Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_SOF))
    {
#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->SOFCallback(husbd);
#else
      HAL_USBDEV_SOFCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_SOF);
    }

    /* Handle Incomplete ISO IN Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_IISOIXFR))
    {
      /* Keep application checking the corresponding Iso IN endpoint
      causing the incomplete Interrupt */
      epnum = 0U;

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->ISOINIncompleteCallback(husbd, (uint8_t)epnum);
#else
      HAL_USBDEV_ISOINIncompleteCallback(husbd, (uint8_t)epnum);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_IISOIXFR);
    }

    /* Handle Incomplete ISO OUT Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_IPXFR_INCOMPISOOUT))
    {
      /* Keep application checking the corresponding Iso OUT endpoint
      causing the incomplete Interrupt */
      epnum = 0U;

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->ISOOUTIncompleteCallback(husbd, (uint8_t)epnum);
#else
      HAL_USBDEV_ISOOUTIncompleteCallback(husbd, (uint8_t)epnum);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_IPXFR_INCOMPISOOUT);
    }

