Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
    /* Handle Connection event Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_SRQINT))
    {
#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
      husbd->ConnectCallback(husbd);
#else
      HAL_USBDEV_ConnectCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

      __HAL_USBDEV_CLEAR_FLAG(husbd, USB_OTG_GINTSTS_SRQINT);
    }

    /* Handle Disconnection event Interrupt */
    if (__HAL_USBDEV_GET_FLAG(husbd, USB_OTG_GINTSTS_OTGINT))
    {
      temp = husbd->Instance->GOTGINT;

      if ((temp & USB_OTG_GOTGINT_SEDET) == USB_OTG_GOTGINT_SEDET)
      {
#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
        husbd->DisconnectCallback(husbd);
#else
        HAL_USBDEV_DisconnectCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */
      }
      husbd->Instance->GOTGINT |= temp;
    }
  }
}
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */


/**
  * @brief  Data OUT stage callback.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_USBDEV_DataOutStageCallback(USBDEV_HandleTypeDef *husbd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_DataOutStageCallback could be implemented in the user file
   */
}

/**
  * @brief  Data IN stage callback
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_USBDEV_DataInStageCallback(USBDEV_HandleTypeDef *husbd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_DataInStageCallback could be implemented in the user file
   */
}
/**
  * @brief  Setup stage callback
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_SetupStageCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_SetupStageCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Start Of Frame callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_SOFCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_SOFCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Reset callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_ResetCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_ResetCallback could be implemented in the user file
   */
}

/**
  * @brief  Suspend event callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_SuspendCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_SuspendCallback could be implemented in the user file
   */
}

/**
  * @brief  Resume event callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_ResumeCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_ResumeCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_USBDEV_ISOOUTIncompleteCallback(USBDEV_HandleTypeDef *husbd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO IN callback.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void HAL_USBDEV_ISOINIncompleteCallback(USBDEV_HandleTypeDef *husbd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Connection event callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_ConnectCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_ConnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection event callback.
  * @param  husbd USBDEV handle
  * @retval None
  */
__weak void HAL_USBDEV_DisconnectCallback(USBDEV_HandleTypeDef *husbd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBDEV_DisconnectCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup USBDEV_Exported_Functions_Group3 Peripheral Control functions
 *  @brief   management functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the USBDEV data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Connect the USB device
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_DevConnect(USBDEV_HandleTypeDef *husbd)
{
  __HAL_LOCK(husbd);
  (void)USB_DevConnect(husbd->Instance);
  __HAL_UNLOCK(husbd);
  return HAL_OK;
}

/**
  * @brief  Disconnect the USB device.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_DevDisconnect(USBDEV_HandleTypeDef *husbd)
{
  __HAL_LOCK(husbd);
  (void)USB_DevDisconnect(husbd->Instance);
  __HAL_UNLOCK(husbd);
  return HAL_OK;
}

/**
  * @brief  Set the USB Device address.
  * @param  husbd USBDEV handle
  * @param  address new device address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_SetAddress(USBDEV_HandleTypeDef *husbd, uint8_t address)
{
  __HAL_LOCK(husbd);
  husbd->USB_Address = address;
  (void)USB_SetDevAddress(husbd->Instance, address);
  __HAL_UNLOCK(husbd);
  return HAL_OK;
}
/**
  * @brief  Open and configure an endpoint.
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @param  ep_mps endpoint max packet size
  * @param  ep_type endpoint type
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_Open(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr, uint16_t ep_mps, uint8_t ep_type)
{
  HAL_StatusTypeDef  ret = HAL_OK;
  USBDEV_EPTypeDef *ep;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &husbd->IN_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 1U;
  }
  else
  {
    ep = &husbd->OUT_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 0U;
  }

