Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
  ep->num = ep_addr & EP_ADDR_MSK;
  ep->maxpacket = ep_mps;
  ep->type = ep_type;

  if (ep->is_in != 0U)
  {
    /* Assign a Tx FIFO */
    ep->tx_fifo_num = ep->num;
  }
  /* Set initial data PID. */
  if (ep_type == EP_TYPE_BULK)
  {
    ep->data_pid_start = 0U;
  }

  __HAL_LOCK(husbd);
  (void)USB_ActivateEndpoint(husbd->Instance, ep);
  __HAL_UNLOCK(husbd);

  return ret;
}

/**
  * @brief  Deactivate an endpoint.
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_Close(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr)
{
  USBDEV_EPTypeDef *ep;

  if ((ep_addr & 0x80U) == 0x80U)
  {
    ep = &husbd->IN_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 1U;
  }
  else
  {
    ep = &husbd->OUT_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 0U;
  }
  ep->num   = ep_addr & EP_ADDR_MSK;

  __HAL_LOCK(husbd);
  (void)USB_DeactivateEndpoint(husbd->Instance, ep);
  __HAL_UNLOCK(husbd);
  return HAL_OK;
}


/**
  * @brief  Receive an amount of data.
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the reception buffer
  * @param  len amount of data to be received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_Receive(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
  USBDEV_EPTypeDef *ep;

  ep = &husbd->OUT_ep[ep_addr & EP_ADDR_MSK];

  /*setup and start the Xfer */
  ep->xfer_buff = pBuf;
  ep->xfer_len = len;
  ep->xfer_count = 0U;
  ep->is_in = 0U;
  ep->num = ep_addr & EP_ADDR_MSK;

  if ((ep_addr & EP_ADDR_MSK) == 0U)
  {
    (void)USB_EP0StartXfer(husbd->Instance, ep);
  }
  else
  {
    (void)USB_EPStartXfer(husbd->Instance, ep);
  }

  return HAL_OK;
}

/**
  * @brief  Get Received Data Size
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @retval Data Size
  */
uint32_t HAL_USBDEV_EP_GetRxCount(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr)
{
  return husbd->OUT_ep[ep_addr & EP_ADDR_MSK].xfer_count;
}
/**
  * @brief  Send an amount of data
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the transmission buffer
  * @param  len amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_Transmit(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
  USBDEV_EPTypeDef *ep;

  ep = &husbd->IN_ep[ep_addr & EP_ADDR_MSK];

  /*setup and start the Xfer */
  ep->xfer_buff = pBuf;
  ep->xfer_len = len;
  ep->xfer_count = 0U;
  ep->is_in = 1U;
  ep->num = ep_addr & EP_ADDR_MSK;

  if ((ep_addr & EP_ADDR_MSK) == 0U)
  {
    (void)USB_EP0StartXfer(husbd->Instance, ep);
  }
  else
  {
    (void)USB_EPStartXfer(husbd->Instance, ep);
  }

  return HAL_OK;
}

/**
  * @brief  Set a STALL condition over an endpoint
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_SetStall(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr)
{
  USBDEV_EPTypeDef *ep;

  if (((uint32_t)ep_addr & EP_ADDR_MSK) > husbd->Init.dev_endpoints)
  {
    return HAL_ERROR;
  }

  if ((0x80U & ep_addr) == 0x80U)
  {
    ep = &husbd->IN_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 1U;
  }
  else
  {
    ep = &husbd->OUT_ep[ep_addr];
    ep->is_in = 0U;
  }

  ep->is_stall = 1U;
  ep->num = ep_addr & EP_ADDR_MSK;

  __HAL_LOCK(husbd);

  (void)USB_EPSetStall(husbd->Instance, ep);

  if ((ep_addr & EP_ADDR_MSK) == 0U)
  {
    (void)USB_EP0_OutStart(husbd->Instance, (uint8_t *)husbd->Setup);
  }
  __HAL_UNLOCK(husbd);

  return HAL_OK;
}

/**
  * @brief  Clear a STALL condition over in an endpoint
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_ClrStall(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr)
{
  USBDEV_EPTypeDef *ep;

  if (((uint32_t)ep_addr & 0x0FU) > husbd->Init.dev_endpoints)
  {
    return HAL_ERROR;
  }

  if ((0x80U & ep_addr) == 0x80U)
  {
    ep = &husbd->IN_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 1U;
  }
  else
  {
    ep = &husbd->OUT_ep[ep_addr & EP_ADDR_MSK];
    ep->is_in = 0U;
  }

  ep->is_stall = 0U;
  ep->num = ep_addr & EP_ADDR_MSK;

  __HAL_LOCK(husbd);
  (void)USB_EPClearStall(husbd->Instance, ep);
  __HAL_UNLOCK(husbd);

  return HAL_OK;
}

/**
  * @brief  Flush an endpoint
  * @param  husbd USBDEV handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_EP_Flush(USBDEV_HandleTypeDef *husbd, uint8_t ep_addr)
{
  __HAL_LOCK(husbd);

  if ((ep_addr & 0x80U) == 0x80U)
  {
    (void)USB_FlushTxFifo(husbd->Instance, (uint32_t)ep_addr & EP_ADDR_MSK);
  }
  else
  {
    (void)USB_FlushRxFifo(husbd->Instance);
  }

  __HAL_UNLOCK(husbd);

  return HAL_OK;
}

/**
  * @brief  Activate remote wakeup signalling
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_ActivateRemoteWakeup(USBDEV_HandleTypeDef *husbd)
{
  return (USB_ActivateRemoteWakeup(husbd->Instance));
}

/**
  * @brief  De-activate remote wakeup signalling.
  * @param  husbd USBDEV handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBDEV_DeActivateRemoteWakeup(USBDEV_HandleTypeDef *husbd)
{
  return (USB_DeActivateRemoteWakeup(husbd->Instance));
}

/**
  * @}
  */

/** @defgroup USBDEV_Exported_Functions_Group4 Peripheral State functions
 *  @brief   Peripheral State functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the USBDEV handle state.
  * @param  husbd USBDEV handle
  * @retval HAL state
  */
USBDEV_StateTypeDef HAL_USBDEV_GetState(USBDEV_HandleTypeDef *husbd)
{
  return husbd->State;
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @addtogroup USBDEV_Private_Functions
  * @{
  */
#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)
/**
  * @brief  Check FIFO for the next packet to be loaded.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval HAL status
  */
static HAL_StatusTypeDef USBDEV_WriteEmptyTxFifo(USBDEV_HandleTypeDef *husbd, uint32_t epnum)
{
  USB_OTG_GlobalTypeDef *USBx = husbd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  USB_OTG_EPTypeDef *ep;
  uint32_t len;
  uint32_t len32b;
  uint32_t fifoemptymsk;

  ep = &husbd->IN_ep[epnum];

  if (ep->xfer_count > ep->xfer_len)
  {
    return HAL_ERROR;
  }

  len = ep->xfer_len - ep->xfer_count;

