Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbd.c
  if (len > ep->maxpacket)
  {
    len = ep->maxpacket;
  }

  len32b = (len + 3U) / 4U;

  while (((USBx_INEP(epnum)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV) >= len32b) &&
         (ep->xfer_count < ep->xfer_len) && (ep->xfer_len != 0U))
  {
    /* Write the FIFO */
    len = ep->xfer_len - ep->xfer_count;

    if (len > ep->maxpacket)
    {
      len = ep->maxpacket;
    }
    len32b = (len + 3U) / 4U;

    (void)USB_WritePacket(USBx, ep->xfer_buff, (uint8_t)epnum, (uint16_t)len);

    ep->xfer_buff  += len;
    ep->xfer_count += len;
  }

  if (ep->xfer_len <= ep->xfer_count)
  {
    /* All data in fifo, diasble tx fifo empty interrupt for this EP */
    fifoemptymsk = (uint32_t)(0x1UL << (epnum & EP_ADDR_MSK));
    USBx_DEVICE->DIEPEMPMSK &= ~fifoemptymsk;
  }

  return HAL_OK;
}


/**
  * @brief  process EP OUT transfer complete interrupt.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval HAL status
  */
static HAL_StatusTypeDef USBDEV_EP_OutXfrComplete_int(USBDEV_HandleTypeDef *husbd, uint32_t epnum)
{

#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
  husbd->DataOutStageCallback(husbd, (uint8_t)epnum);
#else
  HAL_USBDEV_DataOutStageCallback(husbd, (uint8_t)epnum);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

  return HAL_OK;
}


/**
  * @brief  process EP OUT setup packet received interrupt.
  * @param  husbd USBDEV handle
  * @param  epnum endpoint number
  * @retval HAL status
  */
static HAL_StatusTypeDef USBDEV_EP_OutSetupPacket_int(USBDEV_HandleTypeDef *husbd, uint32_t epnum)
{

  /* Inform the upper layer that a setup packet is available */
#if (USE_HAL_USBDEV_REGISTER_CALLBACKS == 1U)
  husbd->SetupStageCallback(husbd);
#else
  HAL_USBDEV_SetupStageCallback(husbd);
#endif /* USE_HAL_USBDEV_REGISTER_CALLBACKS */

  return HAL_OK;
}
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */


/**
  * @}
  */
#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */
#endif /* HAL_USBD_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
